
{
  "videos": [
    {
      "title": "2022 Corvette C8 Z06 Spy Shots and Exhaust SOUND! *Mid Engine Corvette*\n",
      "description": "The 2022 Corvette and the much anticipated brother the Z06! Get to see spy shot of the 2022 Z06, and listen to the throaty exhaust note as it zips by our cameras!",
      "url": "https://www.youtube.com/watch?v=jmKNnL9iI2A",
      "updated": "2020-08-19T17:09:43+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/jmKNnL9iI2A/hqdefault.jpg"
    },
    {
      "title": "Here’s Why the 2020 Chevy Corvette C8 Is The Hottest Car of the Year\n",
      "description": "The 2020 Chevy Corvette C8 is the hottest car of the year -- by far. Today I'm going to review the new C8 Corvette, and I'm going to take you on a tour of the new 2020 Corvette. Then I'm going to drive the 2020 C8 Corvette and tell you what it's like on the road.",
      "url": "https://www.youtube.com/watch?v=yZT3hyhao-o",
      "updated": "2020-03-17T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/yZT3hyhao-o/hqdefault.jpg"
    },
    {
      "title": "2020 C8 Corvette Z51 Review // Expectation vs Reality\n",
      "description": "Thomas and James finally get behind the wheel of the much anticipated 2020 C8 Chevrolet Corvette Stingray, with Z51 Package (performance exhaust, tightened suspension, larger Brembo brakes, and an electronic limited-slip differential) and a bunch of other added extras. At an MSRP of over 100K Canadian, could this be the best performance bargain on sale? Does it render a Supra useless? For that matter, is it a supercar killer?",
      "url": "https://www.youtube.com/watch?v=5UQB17UWxvQ",
      "updated": "2020-06-17T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=5UQB17UWxvQ/hqdefault.jpg"
    },
    {
      "title": "The 2020 Chevy C8 Corvette is the Bargain Mid-Engine Supercar of the Decade\n",
      "description": "After nearly 60 years, the @Chevrolet #Corvette has FINALLY gone mid-engine for 2020. The all-new #C8Corvette broke the internet when it was announced last year and with a completely new chassis, quick-shifting 8-speed DCT, nearly 500 HP, and 0-60 in 2.9 seconds with the Z51 performance package, it will go down in history as the most impressive #ChevroletCorvette in history. The exotic car looks will get you attention everywhere and for those of you who want even more speed, Z06 and ZR1 versions are on the way in the next couple years. ",
      "url": "https://www.youtube.com/watch?v=JDJrKT-A1k4",
      "updated": "2020-07-31T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=JDJrKT-A1k4/hqdefault.jpg"
    },
    {
      "title": "C8 CORVETTE VS ACURA NSX!\n",
      "description": "The owner's comparison you've been waiting for! How does the new C8 Mid-Engine Corvette drive compared to the refreshed Mid-Engine Hybrid-Powered Acura NSX? Find out in today's episode!! I hope you all enjoy! What do you think, should Chevrolet infuse hybrid electrification into a future variant of this new Corvette? ",
      "url": "https://www.youtube.com/watch?v=22cPt29l91M",
      "updated": "2020-08-19T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=22cPt29l91M/hqdefault.jpg"
    },
    {
      "title": "StreetSpeed717 TWIN TURBO C8 Corvette Review!\n",
      "description": "Time for some boosted C8 action! Thanks to Streetspeed717 I had the opportunity to drive one of the first twin turbo Corvette C8's in the country! With the new mid engine setup along with the incredible sound it is no wonder why the C8 has taken the automotive world by storm. So what's it like driving the C8 with twin turbos? Let's go for a drive and find out. Thanks for watching and new uploads every Tuesday,Thursday, and Saturday!",
      "url": "https://www.youtube.com/watch?v=I1t5b-SWCZA",
      "updated": "2020-08-20T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=I1t5b-SWCZA/hqdefault.jpg"
    },
    {
      "title": "Everything we Know About the 2022 Corvette C8 Z06 | + Exhaust Sound Compilation!\n",
      "description": "Hey everyone, welcome back to Daily Downshift. Today we bring you a brief video summarizing everything that we know about the new Corvette C8 Z06 variant which should be designated as a 2022 model. We discuss the engine specifications, transmission, center exit exhaust, price and finally potential options. We are definitely most excited to see the active aero and carbon fiber. We have also included a compilation of videos where you can hear the flat plane crank engine in all its glory. We hope you enjoy!",
      "url": "https://www.youtube.com/watch?v=As7IfF1aK6k",
      "updated": "2020-08-21T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=As7IfF1aK6k/hqdefault.jpg"
    },
    {
      "title": "2020 Chevrolet Corvette Stingray Coupe - POV First Impressions!\n",
      "description": "2020 C8 Chevrolet Corvette Specs\n495 hp; 470 lb-ft torque from a 6.2L pushrod 16-valve V-8 with aluminum block and heads and direct fuel injection\n8-speed dual-clutch automatic transmission\nCurb weight: 3,535 lbs\nDimensions: 182″ L x 76″ W x 49″ H\nMPG: 15 city / 27 highway\nTires: Michelin Pilot Sport 4S ZP, F: 245/35ZR-19 (89Y) R: 305/30ZR-20 (99Y)\nExterior color: Shadow Gray Metallic\nInterior: Adrenaline Red\nMSRP: From $58,900; Price as tested: $72,075",
      "url": "https://www.youtube.com/watch?v=aYBWvNKJ9vw",
      "updated": "2020-07-28T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=aYBWvNKJ9vw/hqdefault.jpg"
    },
    {
      "title": "FIRST DRIVE IN MY TWIN TURBO C8 CORVETTE!!! *It's PERFECT!*\n",
      "description": "MY HIGH COUNTRY DURAMAX GIVEAWAY IS LIVE!!! Every $5 spent on https://inshanedesigns.com/ is worth an  entry To WIN My 2020 3500HD High Country Duramax!!!",
      "url": "https://www.youtube.com/watch?v=rEDPErKT-kQ",
      "updated": "2020-07-22T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=rEDPErKT-kQ/hqdefault.jpg"
    },
    {
      "title": "Is the 2020 Chevrolet C8 Corvette Z51 the Performance Car of the Year?\n",
      "description": "The ULTIMATE Corvette is here! The 2020 C8 is the first mid-engine Corvette ever produced. This Z51 performance package C8 has a 6.2L V8 that is pumping out 495HP & mated to a slick shifting 8-speed DCT gearbox. It's exterior still has the family Corvette face but totally different proportions due to the engine layout. On the inside Chevrolet has brought the level of fit, finish, and materials to an all new high. Is the 2020 Chevrolet C8 Corvette the sports car of the year?\n**Check out https://www.dreamgiveaway.com/ for all the details!\n**Please click the link to get your Raiti's Rides Merch!\n https://shop.spreadshirt.com/raitisrides",
      "url": "https://www.youtube.com/watch?v=0_usnCVlq9M&t=2s",
      "updated": "2020-03-21T16:57:23+00:00",
      "thumbnail": "https://i2.ytimg.com/vi/watch?v=0_usnCVlq9M&t=2s/hqdefault.jpg"
    }
  ]
}